Autodesk.Revit.UI.ExternalDataManagerCommandId.op_Inequality(Autodesk.Revit.UI.ExternalDataManagerCommandId,Autodesk.Revit.UI.ExternalDataManagerCommandId)
Compares two ExternalDataManagerCommandId instances.
first: The first ExternalDataManagerCommandId.
second: The second ExternalDataManagerCommandId.
Returns: True if the inputs are different, false if they are identical.

Autodesk.Revit.UI.ExternalDataManagerCommandId.op_Equality(Autodesk.Revit.UI.ExternalDataManagerCommandId,Autodesk.Revit.UI.ExternalDataManagerCommandId)
Compares two ExternalDataManagerCommandId instances.
first: The first ExternalDataManagerCommandId.
second: The second ExternalDataManagerCommandId.
Returns: True if the inputs are identical, false if they are different.

Autodesk.Revit.UI.ExternalDataManagerCommandId.#ctor(System.Guid)
Creates a new ExternalDataManagerCommandId instance.
guid: The identifier for the ExternalDataManagerCommandId.

Autodesk.Revit.UI.ExternalDataManagerCommandId
Unique identifier of an external data manager command.
Remarks:
Each external data manager command must have a unique GUID.
The Id can be registered with Revit for servers to easily find it.
Unique GUID should be created using GUID generation tool.
Since:
2027